import React from 'react'

export default class NotesAndTips extends React.Component {

    render(){
        return(
            <div style={{padding: 15, maxWidth: this.props.maxWidth, maxHeight: this.props.maxHeight , direction: 'rtl', overflowX: 'hidden'}}>
                <h1>درسنامه</h1>
                <h2>شسیشس</h2>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <h2>شسیشس</h2>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <h2>شسیشس</h2>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <h2>شسیشس</h2>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <h2>شسیشس</h2>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>
                <p>سالم یم شستی سی صایکشسم ابیمهعر دسین لیستاسیمن سیامتاذم یمن شدسبیونتز شوبنرشصثمبسایبشیت بصامی</p>

            </div>
        )
    }
}

NotesAndTips.defaultProps = {
    maxWidth : 500,
    maxHeight: 500
};